; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p7---int100n150-m25---int100c200---s83---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level4 level4)
(sum level0 level9 level9)
(sum level0 level14 level14)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level4 level5)
(sum level1 level9 level10)
(sum level1 level14 level15)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level4 level6)
(sum level2 level9 level11)
(sum level2 level14 level16)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level4 level7)
(sum level3 level9 level12)
(sum level3 level14 level17)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level4 level8)
(sum level4 level9 level13)
(sum level4 level14 level18)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level4 level9)
(sum level5 level9 level14)
(sum level5 level14 level19)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level4 level10)
(sum level6 level9 level15)
(sum level6 level14 level20)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level4 level11)
(sum level7 level9 level16)
(sum level7 level14 level21)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level4 level12)
(sum level8 level9 level17)
(sum level8 level14 level22)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level4 level13)
(sum level9 level9 level18)
(sum level9 level14 level23)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level4 level14)
(sum level10 level9 level19)
(sum level10 level14 level24)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level4 level15)
(sum level11 level9 level20)
(sum level11 level14 level25)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level4 level16)
(sum level12 level9 level21)
(sum level12 level14 level26)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level4 level17)
(sum level13 level9 level22)
(sum level13 level14 level27)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level4 level18)
(sum level14 level9 level23)
(sum level14 level14 level28)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level4 level19)
(sum level15 level9 level24)
(sum level15 level14 level29)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level4 level20)
(sum level16 level9 level25)
(sum level16 level14 level30)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level4 level21)
(sum level17 level9 level26)
(sum level17 level14 level31)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level4 level22)
(sum level18 level9 level27)
(sum level18 level14 level32)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level4 level23)
(sum level19 level9 level28)
(sum level19 level14 level33)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level4 level24)
(sum level20 level9 level29)
(sum level20 level14 level34)
(sum level21 level1 level22)
(sum level21 level4 level25)
(sum level21 level9 level30)
(sum level21 level14 level35)
(sum level22 level1 level23)
(sum level22 level4 level26)
(sum level22 level9 level31)
(sum level22 level14 level36)
(sum level23 level1 level24)
(sum level23 level4 level27)
(sum level23 level9 level32)
(sum level23 level14 level37)
(sum level24 level1 level25)
(sum level24 level4 level28)
(sum level24 level9 level33)
(sum level24 level14 level38)
(sum level25 level1 level26)
(sum level25 level4 level29)
(sum level25 level9 level34)
(sum level25 level14 level39)
(sum level26 level1 level27)
(sum level26 level4 level30)
(sum level26 level9 level35)
(sum level26 level14 level40)
(sum level27 level1 level28)
(sum level27 level4 level31)
(sum level27 level9 level36)
(sum level27 level14 level41)
(sum level28 level1 level29)
(sum level28 level4 level32)
(sum level28 level9 level37)
(sum level28 level14 level42)
(sum level29 level1 level30)
(sum level29 level4 level33)
(sum level29 level9 level38)
(sum level30 level1 level31)
(sum level30 level4 level34)
(sum level30 level9 level39)
(sum level31 level1 level32)
(sum level31 level4 level35)
(sum level31 level9 level40)
(sum level32 level1 level33)
(sum level32 level4 level36)
(sum level32 level9 level41)
(sum level33 level1 level34)
(sum level33 level4 level37)
(sum level33 level9 level42)
(sum level34 level1 level35)
(sum level34 level4 level38)
(sum level35 level1 level36)
(sum level35 level4 level39)
(sum level36 level1 level37)
(sum level36 level4 level40)
(sum level37 level1 level38)
(sum level37 level4 level41)
(sum level38 level1 level39)
(sum level38 level4 level42)
(sum level39 level1 level40)
(sum level40 level1 level41)
(sum level41 level1 level42)

(connected l0 l1)
(fuelcost level23 l0 l1)
(connected l0 l2)
(fuelcost level4 l0 l2)
(connected l0 l3)
(fuelcost level23 l0 l3)
(connected l1 l0)
(fuelcost level23 l1 l0)
(connected l1 l2)
(fuelcost level1 l1 l2)
(connected l1 l3)
(fuelcost level14 l1 l3)
(connected l2 l0)
(fuelcost level4 l2 l0)
(connected l2 l1)
(fuelcost level1 l2 l1)
(connected l2 l3)
(fuelcost level9 l2 l3)
(connected l3 l0)
(fuelcost level23 l3 l0)
(connected l3 l1)
(fuelcost level14 l3 l1)
(connected l3 l2)
(fuelcost level9 l3 l2)

(at t0 l2)
(fuel t0 level42)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l2)
(at p3 l0)
(at p4 l0)
(at p5 l1)
(at p6 l1)
)

(:goal
(and
(at p0 l3)
(at p1 l2)
(at p2 l1)
(at p3 l1)
(at p4 l1)
(at p5 l3)
(at p6 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 7
2. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 7
3. (drive t0 l2 l1 level41 level1 level42)
   deleted: (at t0 l2) (fuel t0 level42)
   added: (at t0 l1) (fuel t0 level41)
   goals met: 0 of 7
4. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 7
5. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 7
6. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 7
7. (drive t0 l1 l2 level40 level1 level41)
   deleted: (at t0 l1) (fuel t0 level41)
   added: (at t0 l2) (fuel t0 level40)
   goals met: 0 of 7
8. (drive t0 l2 l0 level36 level4 level40)
   deleted: (at t0 l2) (fuel t0 level40)
   added: (at t0 l0) (fuel t0 level36)
   goals met: 0 of 7
9. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 1 of 7
10. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 1 of 7
11. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 1 of 7
12. (drive t0 l0 l1 level13 level23 level36)
   deleted: (at t0 l0) (fuel t0 level36)
   added: (at t0 l1) (fuel t0 level13)
   goals met: 1 of 7
13. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 2 of 7
14. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 3 of 7
15. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 4 of 7
16. (drive t0 l1 l2 level12 level1 level13)
   deleted: (at t0 l1) (fuel t0 level13)
   added: (at t0 l2) (fuel t0 level12)
   goals met: 4 of 7
17. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 5 of 7
18. (drive t0 l2 l3 level3 level9 level12)
   deleted: (at t0 l2) (fuel t0 level12)
   added: (at t0 l3) (fuel t0 level3)
   goals met: 5 of 7
19. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 6 of 7
20. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 7 of 7
